---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.PointCloudFilter
source: html/0ace8b90-0b37-9c27-758e-01e3ca2f70cb.htm
---
# PointCloudFilter Methods

Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.